# Module 5 Challenge - PyBer_Analysis_Challenge

In [159]:
%matplotlib notebook

In [160]:
# Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [161]:
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data (2).csv"

In [162]:
pd.read_csv(city_data_to_load)

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [163]:
driver_numbers = city_data_df.groupby("city")["driver_count"].sum()
driver_numbers

city
Amandaburgh         12
Barajasview         26
Barronchester       11
Bethanyland         22
Bradshawfurt         7
                    ..
West Robert         39
West Samuelburgh    73
Williamsonville      2
Williamsstad        59
Williamsview        46
Name: driver_count, Length: 120, dtype: int64

In [164]:
pd.read_csv(ride_data_to_load)

                    city             date   fare        ride_id
0     Lake Jonathanshire  1/14/2019 10:14  13.83  5739410935873
1     South Michelleport   3/4/2019 18:24  30.24  2343912425577
2     Port Samanthamouth   2/24/2019 4:29  33.44  2005065760003
3             Rodneyfort  2/10/2019 23:22  23.44  5149245426178
4             South Jack    3/6/2019 4:28  34.58  3908451377344
...                  ...              ...    ...            ...
2370         Michaelberg  4/29/2019 17:04  13.38  8550365057598
2371     Lake Latoyabury   1/30/2019 0:05  20.76  9018727594352
2372         North Jaime  2/10/2019 21:03  11.11  2781339863778
2373        West Heather   5/7/2019 19:22  44.94  4256853490277
2374          Newtonview  4/25/2019 10:20  55.84  9990581345298

[2375 rows x 4 columns]

In [165]:
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [166]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban

# Calculate the Total Rides, Drivers, Fares and Average

In [244]:
total_rides = pyber_data_df.count()["ride_id"]
total_rides

2375

In [245]:
total_drivers = pyber_data_df.groupby("type")["driver_count"]
total_drivers.head()

0        5
1       72
2       57
3       34
4       46
1625    11
1626    20
1627    22
1628    19
1629    12
2250     9
2251     8
2252     6
2253     2
2254     2
Name: driver_count, dtype: int64

In [246]:
total_fares = sum(pyber_data_df["fare"])
total_fares

63538.64000000014

In [250]:
total_average_per_fare = total_fares / total_rides
total_average_per_fare

26.753111578947426

In [251]:
pyber_data_df["avg_driver_fares"] = pyber_data_df["fare"] / pyber_data_df["driver_count"]

# Urban Cities Data

In [173]:
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
urban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban

In [174]:
urban_total_rides = urban_cities_df.count()["ride_id"]
urban_total_rides

1625

In [191]:
urban_total_drivers = urban_cities_df.groupby(["city"])["driver_count"].count()
urban_total_drivers.head()

city
Amandaburgh        18
Barajasview        22
Carriemouth        27
Christopherfurt    27
Deanville          19
Name: driver_count, dtype: int64

In [179]:
urban_total_fare = urban_cities_df.groupby(["city"])["fare"]
urban_total_fare.sum()

city
Amandaburgh            443.55
Barajasview            557.31
Carriemouth            764.49
Christopherfurt        661.55
Deanville              491.01
                        ...
West Patrickchester    451.73
West Robert            778.84
West Samuelburgh       544.19
Williamsstad           560.33
Williamsview           531.98
Name: fare, Length: 66, dtype: float64

In [194]:
urban_avg_fares = urban_total_fare.mean()
urban_avg_fares.mean()

24.499121716787847

In [192]:
urban_avg_fares.mean()

24.499121716787847

In [228]:
urban_cities_df["urban_driver_fares"] = urban_cities_df["fare"] / urban_cities_df["driver_count"]

C:\Users\manzs\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [230]:
urban_average_driver_fare = urban_cities_df[["urban_driver_fares"]].mean()
urban_average_driver_fare

urban_driver_fares    1.260707
dtype: float64

In [ ]:
new_urban_data = {type: ["type"], Total_Rides: ["urban_total_rides"], Total_Drivers: ["total"]

# Suburban Cities Data

In [202]:
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
suburban_cities_df.head()

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,1/27/2019 3:08,27.79,6653622887913,11,Suburban
1626,East Kentstad,4/7/2019 19:44,18.75,6575961095852,20,Suburban
1627,Lake Omar,1/17/2019 21:33,21.71,966911700371,22,Suburban
1628,Myersshire,2/27/2019 17:38,17.10,5706770909868,19,Suburban
1629,West Hannah,4/19/2019 1:06,37.78,2273047151891,12,Suburban

In [203]:
suburban_total_rides = suburban_cities_df.count()["ride_id"]
suburban_total_rides

625

In [204]:
suburban_total_drivers = suburban_cities_df.groupby(["city"])["driver_count"].count()
suburban_total_drivers.head()

city
Barronchester    16
Bethanyland      18
Brandonfort      19
Colemanland      22
Davidfurt        17
Name: driver_count, dtype: int64

In [209]:
suburban_total_fare = suburban_cities_df.groupby(["city"])["fare"]
suburban_total_fare.head()

1625    27.79
1626    18.75
1627    21.71
1628    17.10
1629    37.78
        ...
1895    48.24
1897    29.19
1899    27.11
2037    33.84
2052    28.54
Name: fare, Length: 180, dtype: float64

In [208]:
suburban_avg_fares = suburban_total_fare.mean()
suburban_avg_fares.mean()

30.737298033475952

In [240]:
suburban_cities_df["suburban_driver_fares"] = suburban_cities_df["fare"] / suburban_cities_df["driver_count"]

C:\Users\manzs\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [243]:
suburban_average_driver_fares = suburban_cities_df[["suburban_driver_fares"]].mean()
suburban_average_driver_fares

suburban_driver_fares    5.290747
dtype: float64

# Rural Cities Data

In [234]:
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]
rural_cities_df.head()

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,4/13/2019 11:13,43.22,1076079536213,9,Rural
2251,North Holly,2/2/2019 14:54,12.42,1985256326182,8,Rural
2252,Michaelberg,3/27/2019 18:27,54.85,4421836952718,6,Rural
2253,Lake Latoyabury,2/23/2019 21:12,47.90,3269652929887,2,Rural
2254,Lake Latoyabury,5/6/2019 8:57,51.80,4018025271936,2,Rural

In [235]:
rural_rides = rural_cities_df.count()["ride_id"]
rural_total_rides

125

In [236]:
rural_total_drivers = rural_cities_df.groupby(["city"])["driver_count"].count()
rural_total_drivers.head()

city
Bradshawfurt      10
Garzaport          3
Harringtonfort     6
Jessicaport        6
Lake Jamie         6
Name: driver_count, dtype: int64

In [237]:
rural_total_fare = rural_cities_df.groupby(["city"])["fare"]
rural_total_fare.head()

2250    43.22
2251    12.42
2252    54.85
2253    47.90
2254    51.80
        ...
2352    10.79
2354    57.23
2364    28.65
2365    16.29
2374    55.84
Name: fare, Length: 86, dtype: float64

In [238]:
rural_avg_fares = rural_total_fare.mean()
rural_avg_fares.mean()

34.63776503126503

In [239]:
rural_cities_df["rural_driver_fares"] = rural_cities_df["fare"] / suburban_cities_df["driver_count"]

C:\Users\manzs\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [253]:
rural_average_driver_fares = rural_cities_df[["rural_driver_fares"]].mean()
rural_average_driver_fares

rural_driver_fares   NaN
dtype: float64

In [ ]:
pyber_sumary_df = pd.DataFrame({type: ["Rural", "Suburban", "Urban"], 
                  total_rides: [rural_total_rides, suburban_total_rides, urban_total_rides], 
                  total_drivers: [rural_total_drivers, suburban_total_drivers, urban_total_drivers], 
                  total_fares: [rural_total_fare, suburban_total_fare, urban_total_fare], 
                  average_fare_per_ride: [rural_avg_fares, suburban_avg_fares, urban_avg_fares], 
                  average_fare_by_driver: [rural_average_driver_fares, suburban_average_driver_fares, urban_average_driver_fares]})

# Deliverable 2: Multiple Line Plot

In [257]:
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type,avg_driver_fares
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban,2.766000
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban,0.420000
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban,0.586667
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban,0.689412
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban,0.751739

In [265]:
del pyber_data_df["avg_driver_fares"]

In [266]:
new_pyber_data_df = pyber_data_df.rename(columns={"city":"City", "date":'Date', "fare":"Fare", "ride_id": "Ride Id","driver_count": "No. Drivers", "type":"City Type"})
new_pyber_data_df.head()

,City,Date,Fare,Ride Id,No. Drivers,City Type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410935873,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005065760003,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149245426178,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908451377344,46,Urban

In [272]:
date_pyber_data = new_pyber_data_df.set_index("Date")
date_pyber_data.head()

,City,Fare,Ride Id,No. Drivers,City Type
Date,,,,,
1/14/2019 10:14,Lake Jonathanshire,13.83,5739410935873,5,Urban
3/4/2019 18:24,South Michelleport,30.24,2343912425577,72,Urban
2/24/2019 4:29,Port Samanthamouth,33.44,2005065760003,57,Urban
2/10/2019 23:22,Rodneyfort,23.44,5149245426178,34,Urban
3/6/2019 4:28,South Jack,34.58,3908451377344,46,Urban

In [278]:
abbrev_pyber_df = new_pyber_data_df[["Date","City Type", "Fare"]]
abbrev_pyber_df = abbrev_pyber_df.set_index("Date")
abbrev_pyber_df.head()

                City Type   Fare
Date
1/14/2019 10:14     Urban  13.83
3/4/2019 18:24      Urban  30.24
2/24/2019 4:29      Urban  33.44
2/10/2019 23:22     Urban  23.44
3/6/2019 4:28       Urban  34.58

In [284]:
fares_by_types_df = abbrev_pyber_df.groupby("City Type")["Fare"]
fares_by_types_df.sum()

City Type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: Fare, dtype: float64

In [288]:
fare_datetime_df = abbrev_pyber_df.groupby("Date")["City Type", "Fare"]
fare_datetime_df.head(10)

C:\Users\manzs\Anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                City Type   Fare
Date
1/14/2019 10:14     Urban  13.83
3/4/2019 18:24      Urban  30.24
2/24/2019 4:29      Urban  33.44
2/10/2019 23:22     Urban  23.44
3/6/2019 4:28       Urban  34.58
...                   ...    ...
4/29/2019 17:04     Rural  13.38
1/30/2019 0:05      Rural  20.76
2/10/2019 21:03     Rural  11.11
5/7/2019 19:22      Rural  44.94
4/25/2019 10:20     Rural  55.84

[2375 rows x 2 columns]

In [308]:
table = pd.pivot_table(fare_datetime_df, index=["Date"], columns=["Fare"], values=["City Type"])

KeyError: 'City Type'

# Create a Multiple-Line Plot